# Configuration de la connexion à la base de données

In [2]:
import pandas as pd 
import cx_Oracle
import sys
import os

%pylab inline
%load_ext sql

Populating the interactive namespace from numpy and matplotlib

In [3]:
# On Linux this must be None.
# Instead, the Oracle environment must be set before Python starts.
instant_client_dir = None

if sys.platform.startswith("win"):
    instant_client_dir = r"C:\instantclient_21_3"

# On macOS (Intel x86) set the directory to your Instant Client directory
if sys.platform.startswith("darwin"):
    instant_client_dir = os.environ.get("HOME")+"/instantclient_19_8"

# This can be called at most once per process.
if instant_client_dir is not None:
    cx_Oracle.init_oracle_client(lib_dir=instant_client_dir)

utilisateur = os.environ.get("PYTHON_USER", "stag26")

connexion = os.environ.get("PYTHON_CONNECT_STRING", "51.91.76.248:15440/coursdb")

password = os.environ.get("PYTHON_PASSWORD", "Phoenix#Icar79")

print('utilisateur :',utilisateur)
print('connexion   :',connexion)
print('password    :',password)

utilisateur : stag26
connexion   : 51.91.76.248:15440/coursdb
password    : Phoenix#Icar79

# Connexion

In [4]:
connection = cx_Oracle.connect(utilisateur, password, connexion)

In [5]:
%sql oracle+cx_oracle://stag26:Phoenix#Icar79@51.91.76.248:15440/coursdb

'Connected: stag26@coursdb'

In [6]:
print(f"Version base de données : {connection.version}\n"+
      f"Utilisateur             : {connection.username}\n"+
      f"Page de code            : {connection.encoding}\n"+
      f"Chaine de connexion     : {connection.dsn}")

Version base de données : 18.0.0.0.0
Utilisateur             : stag26
Page de code            : UTF-8
Chaine de connexion     : 51.91.76.248:15440/coursdb

# Manipulation des dates
## ADD_MONTHS

In [7]:
%sql SELECT SYSDATE, ADD_MONTHS(SYSDATE,6) FROM DUAL

 * oracle+cx_oracle://stag26:***@51.91.76.248:15440/coursdb
0 rows affected.

[(datetime.datetime(2021, 11, 25, 15, 58, 6), datetime.datetime(2022, 5, 25, 15, 58, 6))]

In [8]:
%sql SELECT ADD_MONTHS('31/01/2011',1) FROM DUAL

 * oracle+cx_oracle://stag26:***@51.91.76.248:15440/coursdb
0 rows affected.

[(datetime.datetime(2011, 2, 28, 0, 0),)]

## MONTHS_BETWEEN

In [9]:
%sql \
SELECT SYSDATE + 35, SYSDATE, 35/31, \
       MONTHS_BETWEEN(SYSDATE + 35,SYSDATE) MB1, \
       MONTHS_BETWEEN('28/08/2011','28/07/2011') MB2 \
FROM DUAL

 * oracle+cx_oracle://stag26:***@51.91.76.248:15440/coursdb
0 rows affected.

[(datetime.datetime(2021, 12, 30, 15, 59, 9), datetime.datetime(2021, 11, 25, 15, 59, 9), Decimal('1.12903225806451612903225806451612903226'), Decimal('1.16129032258064516129032258064516129032'), 1)]

# Retrouver une date

## LAST_DAY

In [11]:
%sql \
SELECT SYSDATE,\
       LAST_DAY(SYSDATE), \
       LAST_DAY(ADD_MONTHS(SYSDATE,1)) \
FROM DUAL

 * oracle+cx_oracle://stag26:***@51.91.76.248:15440/coursdb
0 rows affected.

[(datetime.datetime(2021, 11, 25, 16, 0, 4), datetime.datetime(2021, 11, 30, 16, 0, 4), datetime.datetime(2021, 12, 31, 16, 0, 4))]

## NEXT_DAY

In [12]:
%sql \
SELECT SYSDATE, \
       NEXT_DAY(SYSDATE, 'Lundi') "Lundi", \
       NEXT_DAY(SYSDATE, 'Mardi') "Mardi", \
       NEXT_DAY(SYSDATE, 'Mercredi') "Mercredi", \
       NEXT_DAY(SYSDATE, 'Jeudi') "Jeudi", \
       NEXT_DAY(SYSDATE, 'Vendredi') "Vendredi", \
       NEXT_DAY(SYSDATE, 'Samedi') "Samedi", \
       NEXT_DAY(SYSDATE, 'Dimanche') "Dimanche" \
FROM DUAL

 * oracle+cx_oracle://stag26:***@51.91.76.248:15440/coursdb
0 rows affected.

[(datetime.datetime(2021, 11, 25, 16, 1, 26), datetime.datetime(2021, 11, 29, 16, 1, 26), datetime.datetime(2021, 11, 30, 16, 1, 26), datetime.datetime(2021, 12, 1, 16, 1, 26), datetime.datetime(2021, 12, 2, 16, 1, 26), datetime.datetime(2021, 11, 26, 16, 1, 26), datetime.datetime(2021, 11, 27, 16, 1, 26), datetime.datetime(2021, 11, 28, 16, 1, 26))]

# Arrondis des dates

>> <table style="text-align:left;">
>> <tr>
>>      <th  style="text-align:left;background-color:#053061;color:white;">Format  </th>
>>      <th  style="text-align:left;background-color:#053061;color:white;">Précision pour ROUND et TRUNC  </th>
>> </tr>
>> <tr>
>> <th  style="text-align:left;">CC, SCC                             </th>
>> <th  style="text-align:left;">Le siècle                                 </th>
>> </tr>
>> <tr>
>> <th  style="text-align:left;">SYYYY, YYYY, YEAR, SYEAR, YYY, YY, Y</th>
>> <th  style="text-align:left;">Année                                     </th>
>> </tr>
>> <tr>
>> <th  style="text-align:left;">IYYY, IY, IY, I                     </th>
>> <th  style="text-align:left;">Année ISO                                 </th>
>> </tr>
>> <tr>
>> <th  style="text-align:left;">Q                                   </th>
>> <th  style="text-align:left;">Le numéro du trimestre                    </th>
>> </tr>
>> <tr>
>> <th  style="text-align:left;">MONTH, MON, MM, RM                  </th>
>> <th  style="text-align:left;">Le mois                                   </th>
>> </tr>
>> <tr>
>> <th  style="text-align:left;">WW                                  </th>
>> <th  style="text-align:left;">Numéro de la semaine dans l'année         </th>
>> </tr>
>> <tr>
>> <th  style="text-align:left;">IW                                  </th>
>> <th  style="text-align:left;">Semaine de l'année selon le standard ISO  </th>
>> </tr>
>> <tr>
>> <th  style="text-align:left;">W                                   </th>
>> <th  style="text-align:left;">Numéro de la semaine dans le mois         </th>
>> </tr>
>> <tr>
>> <th  style="text-align:left;">DDD                                 </th>
>> <th  style="text-align:left;">Numéro de jour dans l'année, de 1 à 366   </th>
>> </tr>
>> <tr>
>> <th  style="text-align:left;">DD                                  </th>
>> <th  style="text-align:left;">Numéro de jour dans le mois, de 1 à 31    </th>
>> </tr>
>> <tr>
>> <th  style="text-align:left;">J                                   </th>
>> <th  style="text-align:left;">Numéro de jour de la semaine, de 1 à 7    </th>
>> </tr>
>> <tr>
>> <th  style="text-align:left;">DAY, DY, D                          </th>
>> <th  style="text-align:left;">Le jour de la semaine                     </th>
>> </tr>
>> <tr>
>> <th  style="text-align:left;">HH, HH12, HH24                      </th>
>> <th  style="text-align:left;">Heure                                     </th>
>> </tr>
>> <tr>
>> <th  style="text-align:left;">MI                                  </th>
>> <th  style="text-align:left;">Minute                                    </th>
>> </tr>
>> </table>

## ROUND

In [14]:
%sql \
SELECT NOM, SYSDATE-DATE_NAISSANCE "Date heure",\
ROUND(SYSDATE)-DATE_NAISSANCE "Date" \
FROM EMPLOYES\
FETCH FIRST 5 ROWS ONLY

 * oracle+cx_oracle://stag26:***@51.91.76.248:15440/coursdb
0 rows affected.

[('Berlioz', Decimal('19768.6745601851851851851851851851851852'), 19769),
 ('Nocella', Decimal('16442.6745601851851851851851851851851852'), 16443),
 ('Herve', Decimal('15408.6745601851851851851851851851851852'), 15409),
 ('Mangeard', Decimal('15309.6745601851851851851851851851851852'), 15310),
 ('Cazade', Decimal('15408.6745601851851851851851851851851852'), 15409)]

In [18]:
%sql \
SELECT SYSDATE, \
       ROUND(SYSDATE,'YEAR')"Année", \
       ROUND(SYSDATE,'MONTH')"Mois", \
       ROUND(SYSDATE, 'Q') "Trimestre",\
       SYSDATE+200, \
       ROUND(SYSDATE+200,'YEAR')  "Année",\
       ROUND(SYSDATE+200,'MONTH')"Mois", \
       ROUND(SYSDATE+200,'Q')"Trimestre"\
FROM DUAL

 * oracle+cx_oracle://stag26:***@51.91.76.248:15440/coursdb
0 rows affected.

[(datetime.datetime(2021, 11, 25, 16, 14, 37), datetime.datetime(2022, 1, 1, 0, 0), datetime.datetime(2021, 12, 1, 0, 0), datetime.datetime(2022, 1, 1, 0, 0), datetime.datetime(2022, 6, 13, 16, 14, 37), datetime.datetime(2022, 1, 1, 0, 0), datetime.datetime(2022, 6, 1, 0, 0), datetime.datetime(2022, 7, 1, 0, 0))]

## TRUNC

In [17]:
%sql \
SELECT SYSDATE, \
       TRUNC(SYSDATE,'YEAR')"Année", \
       TRUNC(SYSDATE,'MONTH')"Mois", \
       TRUNC(SYSDATE, 'Q') "Trimestre",\
       SYSDATE+200, \
       TRUNC(SYSDATE+200,'YEAR')  "Année",\
       TRUNC(SYSDATE+200,'MONTH')"Mois", \
       TRUNC(SYSDATE+200,'Q')"Trimestre"\
FROM DUAL

 * oracle+cx_oracle://stag26:***@51.91.76.248:15440/coursdb
0 rows affected.

[(datetime.datetime(2021, 11, 25, 16, 14, 8), datetime.datetime(2021, 1, 1, 0, 0), datetime.datetime(2021, 11, 1, 0, 0), datetime.datetime(2021, 10, 1, 0, 0), datetime.datetime(2022, 6, 13, 16, 14, 8), datetime.datetime(2022, 1, 1, 0, 0), datetime.datetime(2022, 6, 1, 0, 0), datetime.datetime(2022, 4, 1, 0, 0))]

# Atelier 4.3	Le traitement des dates
Écrivez les requêtes vous permettant d’afficher :

>> * La date du prochain dimanche (à ce jour).
>> * Les dates du premier et du dernier jour du mois en cours.
>> * La date du premier jour du trimestre (format ‘Q’).
>> * Le nom, la date de fin de période d’essai (3 mois) et leur ancienneté à ce jour exprimé en mois pour tous les employés.
>> * Le nom et le jour de leur première paie (dernier jour du mois de leur embauche).